{
  "architectures": [
    "Qwen3NextForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "decoder_sparse_step": 1,
  "dtype": "bfloat16",
  "eos_token_id": 151645,
  "full_attention_interval": 4,
  "head_dim": 256,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 5120,
  "layer_types": [
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention",
    "linear_attention",
    "linear_attention",
    "linear_attention",
    "full_attention"
  ],
  "linear_conv_kernel_dim": 4,
  "linear_key_head_dim": 128,
  "linear_num_key_heads": 16,
  "linear_num_value_heads": 32,
  "linear_value_head_dim": 128,
  "max_position_embeddings": 262144,
  "mlp_only_layers": [],
  "model_type": "qwen3_next",
  "moe_intermediate_size": 512,
  "norm_topk_prob": true,
  "num_attention_heads": 16,
  "num_experts": 512,
  "num_experts_per_tok": 10,
  "num_hidden_layers": 48,
  "num_key_value_heads": 2,
  "output_router_logits": false,
  "partial_rotary_factor": 0.25,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 10000000,
  "router_aux_loss_coef": 0.001,
  "shared_expert_intermediate_size": 512,
  "tie_word_embeddings": false,
  "transformers_version": "4.57.1",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936,
  "quantization_config": {
    "config_groups": {
      "group_0": {
        "input_activations": {
          "dynamic": false,
          "num_bits": 4,
          "type": "float",
          "group_size": 16
        },
        "weights": {
          "dynamic": false,
          "num_bits": 4,
          "type": "float",
          "group_size": 16
        },
        "targets": [
          "Linear"
        ]
      }
    },
    "ignore": [
      "lm_head",
      "model.layers.0.linear_attn.conv1d",
      "model.layers.0.linear_attn.in_proj_ba",
      "model.layers.0.linear_attn.in_proj_qkvz",
      "model.layers.0.mlp.gate",
      "model.layers.0.mlp.shared_expert_gate",
      "model.layers.1.linear_attn.conv1d",
      "model.layers.1.linear_attn.in_proj_ba",
      "model.layers.1.linear_attn.in_proj_qkvz",
      "model.layers.1.mlp.gate",
      "model.layers.1.mlp.shared_expert_gate",
      "model.layers.10.linear_attn.conv1d",
      "model.layers.10.linear_attn.in_proj_ba",
      "model.layers.10.linear_attn.in_proj_qkvz",
      "model.layers.10.mlp.gate",
      "model.layers.10.mlp.shared_expert_gate",
      "model.layers.11.mlp.gate",
      "model.layers.11.mlp.shared_expert_gate",
      "model.layers.11.self_attn.k_proj",
      "model.layers.11.self_attn.q_proj",
      "model.layers.11.self_attn.v_proj",
      "model.layers.12.linear_attn.conv1d",
      "model.layers.12.linear_attn.in_proj_ba",
      "model.layers.12.linear_attn.in_proj_qkvz",
      "model.layers.12.mlp.gate",
      "model.layers.12.mlp.shared_expert_gate",
      "model.layers.13.linear_attn.conv1d",
      "model.layers.13.linear_attn.in_proj_ba",
      "model.layers.13.linear_attn.in_proj_qkvz",
      "model.layers.13.mlp.gate",
      "model.layers.13.mlp.shared_expert_gate",
      "model.layers.14.linear_attn.conv1d",
      "model.layers.14.linear_attn.in_proj_ba",
      "model.layers.14.linear_attn.in_proj_qkvz",
      "model.layers.14.mlp.gate",
      "model.layers.14.mlp.shared_expert_gate",
      "model.layers.15.mlp.gate",
      "model.layers.15.mlp.shared_expert_gate",
      "model.layers.15.self_attn.k_proj",
      "model.layers.15.self_attn.q_proj",
      "model.layers.15.self_attn.v_proj",
      "model.layers.16.linear_attn.conv1d",
      "model.layers.16.linear_attn.in_proj_ba",
      "model.layers.16.linear_attn.in_proj_qkvz",
      "model.layers.16.mlp.gate",
      "model.layers.16.mlp.shared_expert_gate",
      "model.layers.17.linear_attn.conv1d",
      "model.layers.17.linear_attn.in_proj_ba",
      "model.layers.17.linear_attn.in_proj_qkvz",
      "model.layers.17.mlp.gate",
      "model.layers.17.mlp.shared_expert_gate",
      "model.layers.18.linear_attn.conv1d",
      "model.layers.18.linear_attn.in_proj_ba",
      "model.layers.18.linear_attn.in_proj_qkvz",
      "model.layers.18.mlp.gate",
      "model.layers.18.mlp.shared_expert_gate",
      "model.layers.19.mlp.gate",
      "model.layers.19.mlp.shared_expert_gate",
      "model.layers.19.self_attn.k_proj",
      "model.layers.19.self_attn.q_proj",
      "model.layers.19.self_attn.v_proj",
      "model.layers.2.linear_attn.conv1d",
      "model.layers.2.linear_attn.in_proj_ba",
      "model.layers.2.linear_attn.in_proj_qkvz",
      "model.layers.2.mlp.gate",
      "model.layers.2.mlp.shared_expert_gate",
      "model.layers.20.linear_attn.conv1d",
      "model.layers.20.linear_attn.in_proj_ba",
      "model.layers.20.linear_attn.in_proj_qkvz",
      "model.layers.20.mlp.gate",
      "model.layers.20.mlp.shared_expert_gate",
      "model.layers.21.linear_attn.conv1d",
      "model.layers.21.linear_attn.in_proj_ba",
      "model.layers.21.linear_attn.in_proj_qkvz",
      "model.layers.21.mlp.gate",
      "model.layers.21.mlp.shared_expert_gate",
      "model.layers.22.linear_attn.conv1d",
      "model.layers.22.linear_attn.in_proj_ba",
      "model.layers.22.linear_attn.in_proj_qkvz",
      "model.layers.22.mlp.gate",
      "model.layers.22.mlp.shared_expert_gate",
      "model.layers.23.mlp.gate",
      "model.layers.23.mlp.shared_expert_gate",
      "model.layers.23.self_attn.k_proj",
      "model.layers.23.self_attn.q_proj",
      "model.layers.23.self_attn.v_proj",
      "model.layers.24.linear_attn.conv1d",
      "model.layers.24.linear_attn.in_proj_ba",
      "model.layers.24.linear_attn.in_proj_qkvz",
      "model.layers.24.mlp.gate",
      "model.layers.24.mlp.shared_expert_gate",
      "model.layers.25.linear_attn.conv1d",
      "model.layers.25.linear_attn.in_proj_ba",
      "model.layers.25.linear_attn.in_proj_qkvz",
      "model.layers.25.mlp.gate",
      "model.layers.25.mlp.shared_expert_gate",
      "model.layers.26.linear_attn.conv1d",
      "model.layers.26.linear_attn.in_proj_ba",
      "model.layers.26.linear_attn.in_proj_qkvz",
      "model.layers.26.mlp.gate",
      "model.layers.26.mlp.shared_expert_gate",
      "model.layers.27.mlp.gate",
      "model.layers.27.mlp.shared_expert_gate",
      "model.layers.27.self_attn.k_proj",
      "model.layers.27.self_attn.q_proj",
      "model.layers.27.self_attn.v_proj",
      "model.layers.28.linear_attn.conv1d",
      "model.layers.28.linear_attn.in_proj_ba",
      "model.layers.28.linear_attn.in_proj_qkvz",
      "model.layers.28.mlp.gate",
      "model.layers.28.mlp.shared_expert_gate",
      "model.layers.29.linear_attn.conv1d",
      "model.layers.29.linear_attn.in_proj_ba",
      "model.layers.29.linear_attn.in_proj_qkvz",
      "model.layers.29.mlp.gate",
      "model.layers.29.mlp.shared_expert_gate",
      "model.layers.3.mlp.gate",
      "model.layers.3.mlp.shared_expert_gate",
      "model.layers.3.self_attn.k_proj",
      "model.layers.3.self_attn.q_proj",
      "model.layers.3.self_attn.v_proj",
      "model.layers.30.linear_attn.conv1d",
      "model.layers.30.linear_attn.in_proj_ba",
      "model.layers.30.linear_attn.in_proj_qkvz",
      "model.layers.30.mlp.gate",
      "model.layers.30.mlp.shared_expert_gate",
      "model.layers.31.mlp.gate",
      "model.layers.31.mlp.shared_expert_gate",
      "model.layers.31.self_attn.k_proj",
      "model.layers.31.self_attn.q_proj",
      "model.layers.31.self_attn.v_proj",
      "model.layers.32.linear_attn.conv1d",
      "model.layers.32.linear_attn.in_proj_ba",
      "model.layers.32.linear_attn.in_proj_qkvz",
      "model.layers.32.mlp.gate",
      "model.layers.32.mlp.shared_expert_gate",
      "model.layers.33.linear_attn.conv1d",
      "model.layers.33.linear_attn.in_proj_ba",
      "model.layers.33.linear_attn.in_proj_qkvz",
      "model.layers.33.mlp.gate",
      "model.layers.33.mlp.shared_expert_gate",
      "model.layers.34.linear_attn.conv1d",
      "model.layers.34.linear_attn.in_proj_ba",
      "model.layers.34.linear_attn.in_proj_qkvz",
      "model.layers.34.mlp.gate",
      "model.layers.34.mlp.shared_expert_gate",
      "model.layers.35.mlp.gate",
      "model.layers.35.mlp.shared_expert_gate",
      "model.layers.35.self_attn.k_proj",
      "model.layers.35.self_attn.q_proj",
      "model.layers.35.self_attn.v_proj",
      "model.layers.36.linear_attn.conv1d",
      "model.layers.36.linear_attn.in_proj_ba",
      "model.layers.36.linear_attn.in_proj_qkvz",
      "model.layers.36.mlp.gate",
      "model.layers.36.mlp.shared_expert_gate",
      "model.layers.37.linear_attn.conv1d",
      "model.layers.37.linear_attn.in_proj_ba",
      "model.layers.37.linear_attn.in_proj_qkvz",
      "model.layers.37.mlp.gate",
      "model.layers.37.mlp.shared_expert_gate",
      "model.layers.38.linear_attn.conv1d",
      "model.layers.38.linear_attn.in_proj_ba",
      "model.layers.38.linear_attn.in_proj_qkvz",
      "model.layers.38.mlp.gate",
      "model.layers.38.mlp.shared_expert_gate",
      "model.layers.39.mlp.gate",
      "model.layers.39.mlp.shared_expert_gate",
      "model.layers.39.self_attn.k_proj",
      "model.layers.39.self_attn.q_proj",
      "model.layers.39.self_attn.v_proj",
      "model.layers.4.linear_attn.conv1d",
      "model.layers.4.linear_attn.in_proj_ba",
      "model.layers.4.linear_attn.in_proj_qkvz",
      "model.layers.4.mlp.gate",
      "model.layers.4.mlp.shared_expert_gate",
      "model.layers.40.linear_attn.conv1d",
      "model.layers.40.linear_attn.in_proj_ba",
      "model.layers.40.linear_attn.in_proj_qkvz",
      "model.layers.40.mlp.gate",
      "model.layers.40.mlp.shared_expert_gate",
      "model.layers.41.linear_attn.conv1d",
      "model.layers.41.linear_attn.in_proj_ba",
      "model.layers.41.linear_attn.in_proj_qkvz",
      "model.layers.41.mlp.gate",
      "model.layers.41.mlp.shared_expert_gate",
      "model.layers.42.linear_attn.conv1d",
      "model.layers.42.linear_attn.in_proj_ba",
      "model.layers.42.linear_attn.in_proj_qkvz",
      "model.layers.42.mlp.gate",
      "model.layers.42.mlp.shared_expert_gate",
      "model.layers.43.mlp.gate",
      "model.layers.43.mlp.shared_expert_gate",
      "model.layers.43.self_attn.k_proj",
      "model.layers.43.self_attn.q_proj",
      "model.layers.43.self_attn.v_proj",
      "model.layers.44.linear_attn.conv1d",
      "model.layers.44.linear_attn.in_proj_ba",
      "model.layers.44.linear_attn.in_proj_qkvz",
      "model.layers.44.mlp.gate",
      "model.layers.44.mlp.shared_expert_gate",
      "model.layers.45.linear_attn.conv1d",
      "model.layers.45.linear_attn.in_proj_ba",
      "model.layers.45.linear_attn.in_proj_qkvz",
      "model.layers.45.mlp.gate",
      "model.layers.45.mlp.shared_expert_gate",
      "model.layers.46.linear_attn.conv1d",
      "model.layers.46.linear_attn.in_proj_ba",
      "model.layers.46.linear_attn.in_proj_qkvz",
      "model.layers.46.mlp.gate",
      "model.layers.46.mlp.shared_expert_gate",
      "model.layers.47.mlp.gate",
      "model.layers.47.mlp.shared_expert_gate",
      "model.layers.47.self_attn.k_proj",
      "model.layers.47.self_attn.q_proj",
      "model.layers.47.self_attn.v_proj",
      "model.layers.5.linear_attn.conv1d",
      "model.layers.5.linear_attn.in_proj_ba",
      "model.layers.5.linear_attn.in_proj_qkvz",
      "model.layers.5.mlp.gate",
      "model.layers.5.mlp.shared_expert_gate",
      "model.layers.6.linear_attn.conv1d",
      "model.layers.6.linear_attn.in_proj_ba",
      "model.layers.6.linear_attn.in_proj_qkvz",
      "model.layers.6.mlp.gate",
      "model.layers.6.mlp.shared_expert_gate",
      "model.layers.7.mlp.gate",
      "model.layers.7.mlp.shared_expert_gate",
      "model.layers.7.self_attn.k_proj",
      "model.layers.7.self_attn.q_proj",
      "model.layers.7.self_attn.v_proj",
      "model.layers.8.linear_attn.conv1d",
      "model.layers.8.linear_attn.in_proj_ba",
      "model.layers.8.linear_attn.in_proj_qkvz",
      "model.layers.8.mlp.gate",
      "model.layers.8.mlp.shared_expert_gate",
      "model.layers.9.linear_attn.conv1d",
      "model.layers.9.linear_attn.in_proj_ba",
      "model.layers.9.linear_attn.in_proj_qkvz",
      "model.layers.9.mlp.gate",
      "model.layers.9.mlp.shared_expert_gate",
      "mtp.layers.0*",
      "mtp.fc"
    ],
    "quant_algo": "NVFP4",
    "kv_cache_scheme": {
      "dynamic": false,
      "num_bits": 8,
      "type": "float"
    },
    "producer": {
      "name": "modelopt",
      "version": "0.0.1.dev443+gc9e06886e.d20260206"
    },
    "quant_method": "modelopt"
  }
}